# Mundo 12: DataFrames e Séries

In [2]:
import pandas as pd
import numpy as np

## Séries

In [6]:
serie_inicial = pd.Series([10, 22, 33, 46, 55])
print(serie_inicial)
random = np.random.randn(5)
random

0    10
1    22
2    33
3    46
4    55
dtype: int64

array([-0.32719461, -1.94325659, -0.23012376,  0.1784518 ,  0.66290881])

In [3]:
# Argumentos: listas/vetores 

serie_inicial = pd.Series([10, 22, 33, 46, 55])

serie_inicial = pd.Series(np.random.randn(5), index = ["Nome linha 1", "Nome linha 2", "C", "D", "E"])

print(serie_inicial)

serie_lista = pd.Series(["Python", "SQL", "VBA"])

serie_lista

Nome linha 1    0.775648
Nome linha 2    0.496989
C              -0.985909
D              -0.660630
E               0.758889
dtype: float64

0    Python
1       SQL
2       VBA
dtype: object

In [3]:
# A partir de dicionários, criando séries temporais

dicionario_cotacoes = {"WEGE3": 20.20, "PETR4": 19.28, "VALE3": 64.90, "PETZ3": 12.03}

serie_cotacoes = pd.Series(dicionario_cotacoes)

print(serie_cotacoes)
print(serie_cotacoes['WEGE3'])
serie_cotacoes[0]

WEGE3    20.20
PETR4    19.28
VALE3    64.90
PETZ3    12.03
dtype: float64
20.2

20.2

## DataFrames

In [4]:
#A partir de outras séries ou dicionários

dicionario_dados = {
    "empresas": pd.Series(["Wege", "Vale", "Petrobras"], index = ["2019", "2020", "2021"]), 
    "price": pd.Series([20, 30, 40], index = ["2019", "2020", "2021"]),
    "volume": pd.Series([1000, 4000, 7500], index = ["2019", "2020", "2021"])
}

dados_diarios = pd.DataFrame(dicionario_dados)

dados_diarios

       empresas  price  volume
2019       Wege     20    1000
2020       Vale     30    4000
2021  Petrobras     40    7500

In [6]:
dicionario_dados = {
    "empresas": ["Wege", "Vale", "Petrobras"],
    "price": [20, 30, 40],
    "volume": [1000, 4000, 7500]
}

dados_diarios_from_dict = pd.DataFrame(dicionario_dados, index = ["2019", "2020", "2021"])

dados_diarios_from_dict

       empresas  price  volume
2019       Wege     20    1000
2020       Vale     30    4000
2021  Petrobras     40    7500

In [8]:
#escolhendo colunas

dicionario_dados = {
    "empresas": ["Wege", "Vale", "Petrobras"],
    "price": [20, 30, 40],
    "volume": [1000, 4000, 7500]
}

dados_diarios_from_dict = pd.DataFrame(dicionario_dados, index = ["2019", "2020", "2021"],
                                      columns = ["volume", "price", "teste"])

dados_diarios_from_dict

      volume  price teste
2019    1000     20   NaN
2020    4000     30   NaN
2021    7500     40   NaN

In [9]:
#cuidado

dado = {"cotacao": 20, "dia": "2019-12-21"}

dataframe = pd.DataFrame(dado, index = [0])

dataframe

   cotacao         dia
0       20  2019-12-21

# Exercícios

* Exercício 19: Crie uma série de numeros.   
* Exercício 20: Crie um DataFrame com as seguintes informações:
	- tickers: “WEGE3”, "PETR3", "VALE3", "PETR4" e "LREN3"
    - cotacoes: 20, 30, 40, 12, 35  
    - nomes: "Weg", "Petrobras", "Vale", "Petrobras" e "Lojas Renner"
    - preco_sobre_lucro: 25, 6, 12, 7, 25  
    - volume: 5000, 1000, 4000, 7000, 1200

In [11]:
# Minha resposta ao exercício 19
numeros = [1, 2, 3, 4, 5]
serie = pd.Series(numeros)
serie

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [15]:
# Minha resposta ao exercício 20
dados_empresas = {
    'nomes': ['Weg', 'Petrobras', 'Vale', 'Petrobras', 'Lojas Renner'],
    'tickers': ['WEGE3', 'PETR3', 'VALE3', 'PETR4', 'LREN3'],
    'cotacoes': [20, 30, 40, 12, 35],
    'preco_sobre_lucro': [25, 6, 12, 7, 25],
    'volume': [5000, 1000, 4000, 7000, 1200]
}

dataframe = pd.DataFrame(dados_empresas)
dataframe

          nomes tickers  cotacoes  preco_sobre_lucro  volume
0           Weg   WEGE3        20                 25    5000
1     Petrobras   PETR3        30                  6    1000
2          Vale   VALE3        40                 12    4000
3     Petrobras   PETR4        12                  7    7000
4  Lojas Renner   LREN3        35                 25    1200

In [ ]:
numeros = [20, 30, 40, 50]

serie = pd.Series(numeros)

serie

In [13]:
dicionario = {
       "nomes": ["Weg", "Petrobras", "Vale", "Petrobras", "Lojas Renner"],
       "tickers": ["WEGE3", "PETR3", "VALE3", "PETR4", "LREN3"],  
       "cotacoes": [20, 30, 40, 12, 35],
       "preco_sobre_lucro": [25, 6, 12, 7, 25],  
       "volume": [5000, 1000, 4000, 7000, 1200]
}

df_info_empresas = pd.DataFrame(dicionario)

df_info_empresas

          nomes tickers  cotacoes  preco_sobre_lucro  volume
0           Weg   WEGE3        20                 25    5000
1     Petrobras   PETR3        30                  6    1000
2          Vale   VALE3        40                 12    4000
3     Petrobras   PETR4        12                  7    7000
4  Lojas Renner   LREN3        35                 25    1200